ahtn/keyplus/efm8/src/usb_test.c
    if (USB_Ep0OutPacketReady()) {
        if (ep0.misc.bits.waitForRead == true) {
            ep0.misc.bits.outPacketPending = true;
        } else if (ep0.state == D_EP_IDLE) {
            // ep0String.c = USB_STRING_DESCRIPTOR_UTF16LE;
            USB_ReadFIFOSetup();

            // Vendor unique, Class or Standard setup commands override?
#if SLAB_USB_SETUP_CMD_CB
            retVal = USBD_SetupCmdCb(&setup);

            if (retVal == USB_STATUS_REQ_UNHANDLED) {
#endif
                if (setup.bmRequestType.Type == USB_SETUP_TYPE_STANDARD) {
                    retVal = USBDCH9_SetupCmd();
                }
#if SLAB_USB_SETUP_CMD_CB
            }
#endif

            // Reset index to 0 in case the call to USBD_SetupCmdCb() or
            // USBDCH9_SetupCmd() changed it.
            USB_SetIndex(0);

            // Put the Enpoint 0 hardware into the correct state here.
            if (retVal == USB_STATUS_OK) {
                // If wLength is 0, there is no Data Phase
                // Set both the Serviced Out Packet Ready and Data End bits
                if (setup.wLength == 0) {
                    USB_Ep0SetLastOutPacketReady();
                }
                // If wLength is non-zero, there is a Data Phase.
                // Set only the Serviced Out Packet Ready bit.
                else {
                    USB_Ep0ServicedOutPacketReady();

#if SLAB_USB_SETUP_CMD_CB
                    // If OUT packet but callback didn't set up a USBD_Read and we are expecting a
                    // data byte then we need to wait for the read to be setup and NACK packets until
                    // USBD_Read is called.
                    if ((setup.bmRequestType.Direction == USB_SETUP_DIR_OUT)
                        && (ep0.state != D_EP_RECEIVING)) {
                        ep0.misc.bits.waitForRead = true;
                    }
#endif
                }
            }
            // If the setup transaction detected an error, send a stall
            else {
                SendEp0Stall();
            }
        } else if (ep0.state == D_EP_RECEIVING) {
            handleUsbEp0Rx();
        } else {
            ep0.misc.bits.outPacketPending = true;
        }
    }

    if ((ep0.state == D_EP_TRANSMITTING) && (USB_Ep0InPacketReady() == 0)) {
        handleUsbEp0Tx();
    }
}

void handleUsbIn1Int(void) {
    bool callback;

    USB_SetIndex(1);

    if (USB_EpnInGetSentStall()) {
        USB_EpnInClearSentStall();
    } else if (ep1in.state == D_EP_TRANSMITTING) {
        uint8_t xferred;
        if (ep1in.remaining > SLAB_USB_EP1IN_MAX_PACKET_SIZE) {
            xferred = SLAB_USB_EP1IN_MAX_PACKET_SIZE;
        } else {
            xferred = ep1in.remaining;
        }
        ep1in.remaining -= xferred;
        ep1in.buf += xferred;

        callback = ep1in.misc.bits.callback;

        // Load more data
        if (ep1in.remaining > 0) {
            uint8_t num_bytes;
            if (ep1in.remaining > SLAB_USB_EP1IN_MAX_PACKET_SIZE) {
                num_bytes = SLAB_USB_EP1IN_MAX_PACKET_SIZE;
            } else {
                num_bytes = ep1in.remaining;
            }
            USB_WriteFIFO(1, num_bytes, ep1in.buf, true);
        } else {
            ep1in.misc.bits.callback = false;
            ep1in.state = D_EP_IDLE;
        }
    }
}

#if SLAB_USB_EP2IN_USED
/***************************************************************************//**
 * @brief       Handle Endpoint 2 IN transfer interrupt
 * @note        This function takes no parameters, but it uses the EP2IN status
 *              variables stored in @ref myUsbDevice.ep2in.
 ******************************************************************************/
void handleUsbIn2Int(void) {
    bool callback;

    USB_SetIndex(2);

    if (USB_EpnInGetSentStall()) {
        USB_EpnInClearSentStall();
    } else if (ep2in.state == D_EP_TRANSMITTING) {
        uint8_t xferred;
        if (ep2in.remaining > SLAB_USB_EP2IN_MAX_PACKET_SIZE) {
            xferred = SLAB_USB_EP2IN_MAX_PACKET_SIZE;
        } else {
            xferred = ep2in.remaining;
        }
        ep2in.remaining -= xferred;
        ep2in.buf += xferred;

        callback = ep2in.misc.bits.callback;

        // Load more data
        if (ep2in.remaining > 0) {
            uint8_t num_bytes;
            if (ep2in.remaining > SLAB_USB_EP2IN_MAX_PACKET_SIZE) {
                num_bytes = SLAB_USB_EP2IN_MAX_PACKET_SIZE;
            } else {
                num_bytes = ep2in.remaining;
            }
            USB_WriteFIFO(2, num_bytes, ep2in.buf, true);
        } else {
            ep2in.misc.bits.callback = false;
            ep2in.state = D_EP_IDLE;
        }
    }
}
#endif // SLAB_USB_EP2IN_USED



#if (SLAB_USB_POLLED_MODE == 0)
void usb_isr(void) __interrupt (USB0_IRQn) {
#else
    void usb_isr(void) {
#endif
        uint8_t statusCommon, statusIn, statusOut, indexSave;

#if SLAB_USB_HANDLER_CB
        // Callback to user before processing
        USBD_EnterHandler();
#endif

        // Get the interrupt sources
        statusCommon = USB_GetCommonInts();
        statusIn = USB_GetInInts();
        statusOut = USB_GetOutInts();

#if SLAB_USB_POLLED_MODE
        if ((statusCommon == 0) && (statusIn == 0) && (statusOut == 0)) {
            return;
        }
#endif

        // Save the current index
        indexSave = USB_GetIndex();

        // Check Common USB Interrupts
        if (USB_IsSofIntActive(statusCommon)) {
#if SLAB_USB_SOF_CB
            USBD_SofCb(USB_GetSofNumber());
#endif // SLAB_USB_SOF_CB

            // Check for unhandled USB packets on EP0 and set the corresponding IN or
            // OUT interrupt active flag if necessary.
            if (
                ((ep0.misc.bits.outPacketPending == true) && (ep0.state == D_EP_RECEIVING)) ||
                ((ep0.misc.bits.inPacketPending == true) && (ep0.state == D_EP_TRANSMITTING))
               ) {
                USB_SetEp0IntActive(statusIn);
            }
        }


        // Check USB Endpoint 0 Interrupt
        if (USB_IsEp0IntActive(statusIn)) {
            handleUsbEp0Int();
        }


