ahtn/keyplus/efm8/src/usb_test.c
    ENABLE_USB_INTS;
    USB_RestoreSfrPage();

    return USB_STATUS_OK;
}

USB_Status_TypeDef USBD_SetupCmdCb(XRAM USB_Setup_TypeDef *setup) {
    USB_Status_TypeDef retVal = USB_STATUS_REQ_UNHANDLED;

    if ((setup->bmRequestType.Type == USB_SETUP_TYPE_STANDARD)
        && (setup->bmRequestType.Direction == USB_SETUP_DIR_IN)
        && (setup->bmRequestType.Recipient == USB_SETUP_RECIPIENT_INTERFACE))
    {
        // A HID device must extend the standard GET_DESCRIPTOR command
        // with support for HID descriptors.
        switch (setup->bRequest) {
            case GET_DESCRIPTOR: {
                if ((setup->wValue >> 8) == USB_HID_REPORT_DESCRIPTOR) {
                    switch (setup->wIndex) {
                        case INTERFACE_BOOT_KEYBOARD: {
                            USBD_Write(
                                EP0,
                                hid_desc_boot_keyboard,
                                EFM8_MIN(sizeof_hid_desc_boot_keyboard, setup->wLength),
                                false
                            );
                            retVal = USB_STATUS_OK;
                        } break;

                        case INTERFACE_SHARED_HID: {
                            USBD_Write(
                                EP0,
                                hid_desc_shared_hid,
                                EFM8_MIN(sizeof_hid_desc_shared_hid, setup->wLength),
                                false
                            );
                            retVal = USB_STATUS_OK;
                        } break;

                        default: // Unhandled Interface
                            break;
                    }
                } else if ((setup->wValue >> 8) == USB_HID_DESCRIPTOR) {
                    switch (setup->wIndex) {
                        case INTERFACE_BOOT_KEYBOARD: {
                            USBD_Write(EP0, &usb_config_desc.hid0,
                                EFM8_MIN(sizeof(usb_hid_desc_t), setup->wLength),
                                false);
                            retVal = USB_STATUS_OK;
                        } break;

                        case INTERFACE_SHARED_HID: {
                            USBD_Write(EP0, &usb_config_desc.hid1,
                                EFM8_MIN(sizeof(usb_hid_desc_t), setup->wLength),
                                false);
                            retVal = USB_STATUS_OK;
                        } break;

                        default: // Unhandled Interface
                            break;
                    }
                }
            } break;
        }
    } else if ((setup->bmRequestType.Type == USB_SETUP_TYPE_CLASS)
        && (setup->bmRequestType.Recipient == USB_SETUP_RECIPIENT_INTERFACE)
        && (setup->wIndex == INTERFACE_BOOT_KEYBOARD)
    ) {
        // Implement the necessary HID class specific commands.
        switch (setup->bRequest) {
            case USB_HID_SET_REPORT: {
                if (((setup->wValue >> 8) == 2)               // Output report
                    && ((setup->wValue & 0xFF) == 0)          // Report ID
                    && (setup->wLength == 1)                  // Report length
                    && (setup->bmRequestType.Direction != USB_SETUP_DIR_IN)
                ) {
                    uint8_t tmpBuffer;
                    USBD_Read(EP0, &tmpBuffer, 1, true);
                    retVal = USB_STATUS_OK;
                }
            } break;

            case USB_HID_GET_REPORT: {
                if (((setup->wValue >> 8) == 1)               // Input report
                    && ((setup->wValue & 0xFF) == 0)          // Report ID
                    && (setup->wLength == 8)                  // Report length
                    && (setup->bmRequestType.Direction == USB_SETUP_DIR_IN))
                {
                    // Send an empty (key released) report
                    USBD_Write(EP0,
                        keyboardReport,
                        sizeof(KeyReport_TypeDef),
                        false);
                    retVal = USB_STATUS_OK;
                }
            } break;

#if 0
            // USB by some OS's to set BOOT protocol for keyboard reports
            // allowing the OS to request the device to fall back to 6KRO
            // if it can't handle NKRO reports.
            // However, not all OS's support this, so we can't rely on this
            // to support both 6KRO and NKRO. Instead, we use a different
            // use both a NKRO and 6KRO report as a work around, and
            // use the 6KRO report at boot, and switch to the NKRO later.
            case USB_REQ_HID_SET_PROTOCOL: {
            } break;
            case USB_REQ_HID_GET_PROTOCOL: {
            } break;
#endif

#if 0
            // Technically necessary by USB HID spec, but doesn't seem to be
            // used in practice by most OS's for keyboards
            case USB_HID_SET_IDLE:
                if (((setup->wValue & 0xFF) == 0)             // Report ID
                    && (setup->wLength == 0)
                    && (setup->bmRequestType.Direction != USB_SETUP_DIR_IN))
                {
                    idleTimerSet(setup->wValue >> 8);
                    retVal = USB_STATUS_OK;
                }
                break;

            case USB_HID_GET_IDLE:
                if ((setup->wValue == 0)                      // Report ID
                    && (setup->wLength == 1)
                    && (setup->bmRequestType.Direction == USB_SETUP_DIR_IN))
                {
                    tmpBuffer = idleGetRate();
                    USBD_Write(EP0, &tmpBuffer, 1, false);
                    retVal = USB_STATUS_OK;
                }
                break;
#endif
        }
    }

    return retVal;
}

int8_t USBD_Read(uint8_t epAddr, void *dat, uint16_t byteCount, bool callback) {
    bool usbIntsEnabled;
    XRAM USBD_Ep_TypeDef *ep;

    USB_SaveSfrPage();

    // Verify the endpoint address is valid.
    switch (epAddr) {
        case EP0:
#if SLAB_USB_EP1OUT_USED
        case EP1OUT:
#endif
#if SLAB_USB_EP2OUT_USED
        case EP2OUT:
#endif
#if SLAB_USB_EP3OUT_USED
        case EP3OUT:
#endif
            break;
#if SLAB_USB_EP1IN_USED
        case EP1IN:
#endif
#if SLAB_USB_EP2IN_USED
        case EP2IN:
#endif
#if SLAB_USB_EP3IN_USED
        case EP3IN:
#endif
        default:
            SLAB_ASSERT(false);
            return USB_STATUS_ILLEGAL;
    }

    // If the device has not been configured, we cannot start a transfer.
    if ((epAddr != EP0) && (s_usb_state != USBD_STATE_CONFIGURED)) {
        return USB_STATUS_DEVICE_UNCONFIGURED;
    }

    ep = GetEp(epAddr);

    // If the endpoint is not idle, we cannot start a new transfer.
    // Return the appropriate error code.
    if (ep->state != D_EP_IDLE) {
        if (ep->state == D_EP_STALL) {
            return USB_STATUS_EP_STALLED;
        } else {
            return USB_STATUS_EP_BUSY;
        }
    }

    DISABLE_USB_INTS;

    ep->buf = dat;
    ep->remaining = byteCount;
    ep->state = D_EP_RECEIVING;
    ep->misc.bits.callback = callback;
    ep->misc.bits.waitForRead = false;

    // If isochronous, set the buffer index to 0
#if ((SLAB_USB_EP3OUT_USED) && (SLAB_USB_EP3OUT_TRANSFER_TYPE == USB_EPTYPE_ISOC))
    if (epAddr == EP3OUT) {
        ep3outIsoIdx = 0;
    }
#endif

    ENABLE_USB_INTS;
    USB_RestoreSfrPage();

    return USB_STATUS_OK;
}
